### Cleaning the dataset

In [1]:
import pandas as pd
trxns = pd.read_csv("./bank_transactions.csv")

In [2]:
trxns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 16 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   TransactionID            2512 non-null   object
 1   AccountID                2512 non-null   object
 2   TransactionAmount        2512 non-null   float64
 3   TransactionDate          2512 non-null   object
 4   TransactionType          2512 non-null   object
 5   Location                 2512 non-null   object
 6   DeviceID                 2512 non-null   object
 7   IP Address               2512 non-null   object
 8   MerchantID               2512 non-null   object
 9   Channel                  2512 non-null   object
 10  CustomerAge              2512 non-null   int64
 11  CustomerOccupation       2512 non-null   object
 12  TransactionDuration      2512 non-null   int64
 13  LoginAttempts            2512 non-null   int64
 14  AccountBalance           2512 non-null   float64
 15  PreviousTransactionDate  2512 non-null   object
dtypes: float64(2), int64(3), object(11)
memory usage: 314.1+ KB

In [3]:
trxns.head()

,TransactionID,AccountID,TransactionAmount,TransactionDate,TransactionType,Location,DeviceID,IP Address,MerchantID,Channel,CustomerAge,CustomerOccupation,TransactionDuration,LoginAttempts,AccountBalance,PreviousTransactionDate
0,TX000001,AC00128,14.09,2023-04-11 16:29:14,Debit,San Diego,D000380,162.198.218.92,M015,ATM,70,Doctor,81,1,5112.21,2024-11-04 08:08:08
1,TX000002,AC00455,376.24,2023-06-27 16:44:19,Debit,Houston,D000051,13.149.61.4,M052,ATM,68,Doctor,141,1,13758.91,2024-11-04 08:09:35
2,TX000003,AC00019,126.29,2023-07-10 18:16:08,Debit,Mesa,D000235,215.97.143.157,M009,Online,19,Student,56,1,1122.35,2024-11-04 08:07:04
3,TX000004,AC00070,184.50,2023-05-05 16:32:11,Debit,Raleigh,D000187,200.13.225.150,M002,Online,26,Student,25,1,8569.06,2024-11-04 08:09:06
4,TX000005,AC00411,13.45,2023-10-16 17:51:24,Credit,Atlanta,D000308,65.164.3.100,M091,Online,26,Student,198,1,7429.40,2024-11-04 08:06:39

In [4]:
# Converting Dates to Datetime Format (TransactionDate, PreviousTransactionDate)
trxns['TransactionDate'] = pd.to_datetime(trxns['TransactionDate'])
trxns['PreviousTransactionDate'] = pd.to_datetime(trxns['PreviousTransactionDate'])

In [5]:
trxns['TransactionDate'].head()

0   2023-04-11 16:29:14
1   2023-06-27 16:44:19
2   2023-07-10 18:16:08
3   2023-05-05 16:32:11
4   2023-10-16 17:51:24
Name: TransactionDate, dtype: datetime64[ns]

In [6]:
trxns['PreviousTransactionDate'].head()

0   2024-11-04 08:08:08
1   2024-11-04 08:09:35
2   2024-11-04 08:07:04
3   2024-11-04 08:09:06
4   2024-11-04 08:06:39
Name: PreviousTransactionDate, dtype: datetime64[ns]

In [9]:
# How many total transactions? | What’s the average transaction amount? | What’s the most common transaction type?

total_trxns = len(trxns)
average_trxns_amount = round(trxns['TransactionAmount'].dropna().mean(), 2)
most_common_type = trxns["TransactionType"].mode()[0]

print(total_trxns, average_trxns_amount, most_common_type)

2512 297.59 Debit